Revit 2027 API
UV.GetLength Method
The length of this 2-D vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetLength()
Public Function GetLength As Double
public:
double GetLength()
member GetLength : unit -> float
Return Value
Double
Remarks
 In 2-D Euclidean space, the length of the vector is the square root of the sum of the two coordinates squared.
See Also
Reference
UV Class
Autodesk.Revit.DB Namespace